Repository: youtonghy/Todex_mobile
Catalog: Todex/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko

source: 未命名后端
en: Unnamed backend
ja: 名称未設定のバックエンド
ko: 이름 없는 백엔드

source: 未填写
en: Not set
ja: 未入力
ko: 입력 안 됨

source: 未填写，如 my-provider
en: Not set, e.g. my-provider
ja: 未入力（例：my-provider）
ko: 입력 안 됨(예: my-provider)

source: 未安装
en: Not installed
ja: 未インストール
ko: 설치되지 않음

source: 未完成
en: Incomplete
ja: 未完了
ko: 미완료

source: 未托管 · 点按收编
en: Unmanaged · Tap to adopt
ja: 未管理 · タップして取り込む
ko: 관리 안 함 · 탭하여 가져오기

source: 未托管 · 默认 · 点按收编
en: Unmanaged · Default · Tap to adopt
ja: 未管理 · デフォルト · タップして取り込む
ko: 관리 안 함 · 기본 · 탭하여 가져오기

source: 未报告
en: Not reported
ja: 未報告
ko: 보고되지 않음

source: 未提供
en: Not provided
ko: 제공되지 않음

source: 未收到 terminal.started，请查询状态
en: terminal.started was not received; check the status
ja: terminal.started を受信していません。状態を確認してください
ko: terminal.started를 받지 못했습니다. 상태를 확인하세요

source: 未收到终端列表；请确认宿主返回 terminal.status 实际结果
en: Terminal list not received; make sure the host returns the actual terminal.status result
ja: ターミナル一覧を受信していません。ホストが terminal.status の実際の結果を返しているか確認してください
ko: 터미널 목록을 받지 못했습니다. 호스트가 terminal.status의 실제 결과를 반환하는지 확인하세요

source: 未知
en: Unknown
ja: 不明
ko: 알 수 없음

source: 未知分支
en: Unknown branch
ja: 不明なブランチ
ko: 알 수 없는 브랜치

source: 未知状态
en: Unknown status
ja: 不明な状態
ko: 알 수 없는 상태

source: 未缓存输入
en: Uncached input
ja: 非キャッシュ入力
ko: 캐시되지 않은 입력

source: 未获取
en: Not fetched
ja: 未取得
ko: 가져오지 않음

source: 未获得相机权限。可前往系统设置允许访问，或返回使用照片导入。
en: Camera access not granted. Allow access in Settings, or go back and import from Photos.
ja: カメラへのアクセスが許可されていません。設定でアクセスを許可するか、戻って写真から読み込んでください。
ko: 카메라 권한이 없습니다. 설정에서 접근을 허용하거나 돌아가서 사진으로 가져오세요.

source: 未设置
en: Not set
ja: 未設定
ko: 설정 안 됨

source: 未返回模型
en: No models returned
ja: モデルが返されませんでした
ko: 반환된 모델 없음

source: 未连接
en: Not connected
ja: 未接続
ko: 연결 안 됨

source: 未连接（当前会话使用其他后端）
en: Not connected (this session uses another backend)
ja: 未接続（現在のセッションは別のバックエンドを使用中）
ko: 연결 안 됨(현재 세션은 다른 백엔드 사용 중)

source: 未选择
en: Not selected
ja: 未選択
ko: 선택 안 됨

source: 未配置
en: Not configured
ja: 未設定
ko: 구성 안 됨

source: 未采用该版本；原本地编辑仍保留，请再次保存并完成合并。
en: That version was not applied; your local edits are kept. Save again to complete the merge.
ja: そのバージョンは採用されませんでした。ローカルの編集は保持されています。再度保存してマージを完了してください。
ko: 해당 버전을 적용하지 않았습니다. 로컬 편집은 그대로 유지됩니다. 다시 저장하여 병합을 완료하세요.

source: 未验证
en: Unverified
ja: 未検証
ko: 확인되지 않음

source: 本会话内允许
en: Allow for this session
ja: このセッション中は許可
ko: 이 세션에서 허용

source: 本地保存失败：%@
en: Failed to save locally: %@
ja: ローカル保存に失敗しました：%@
ko: 로컬 저장 실패: %@

source: 本地状态未完成加载
en: Local state has not finished loading
ja: ローカル状態の読み込みが完了していません
ko: 로컬 상태 로드가 완료되지 않았습니다

source: 本地编辑不会自动保存。
en: Local edits are not saved automatically.
ja: ローカルの編集は自動保存されません。
ko: 로컬 편집은 자동으로 저장되지 않습니다.

source: 本地草稿仍在加载
en: Local draft is still loading
ja: ローカルの下書きを読み込み中です
ko: 로컬 초안을 아직 로드하는 중입니다

source: 本机为此后端保存的最近 2000 条 token 用量，含已关闭的对话
en: The last 2000 token usage records saved on this device for this backend, including closed conversations
ja: この端末に保存された、このバックエンドの直近 2000 件の token 使用量（閉じた会話を含む）
ko: 이 기기에 저장된 이 백엔드의 최근 token 사용량 2000건(닫힌 대화 포함)

source: 本机设备
en: This device
ja: この端末
ko: 이 기기

source: 本次允许
en: Allow once
ja: 今回のみ許可
ko: 이번만 허용

source: 本次操作结果未知，可能已部分或全部执行。
en: The result of this action is unknown; it may have been partially or fully executed.
ja: この操作の結果は不明です。一部またはすべてが実行された可能性があります。
ko: 이번 작업의 결과를 알 수 없습니다. 일부 또는 전부 실행되었을 수 있습니다.

source: 本轮用量
en: Usage this turn
ja: このターンの使用量
ko: 이번 차례 사용량

source: 权限
en: Permissions
ja: 権限
ko: 권한

source: 权限模式
en: Permission mode
ja: 権限モード
ko: 권한 모드

source: 权限模式未选择，请重新选择
en: No permission mode selected; select one again
ja: 権限モードが選択されていません。もう一度選択してください
ko: 권한 모드가 선택되지 않았습니다. 다시 선택하세요

source: 权限模式：%@
en: Permission mode: %@
ja: 権限モード：%@
ko: 권한 모드: %@

source: 条目
en: Entries
ja: 項目
ko: 항목

source: 来源：后端 Git 状态
en: Source: backend Git status
ja: ソース：バックエンドの Git 状態
ko: 출처: 백엔드 Git 상태

source: 构成
en: Breakdown
ja: 内訳
ko: 구성

source: 查看 PR
en: View PR
ja: PR を表示
ko: PR 보기

source: 查看后端提供的 JSON Schema
en: View the JSON Schema provided by the backend
ja: バックエンドが提供する JSON Schema を表示
ko: 백엔드가 제공한 JSON Schema 보기

source: 查看完整请求
en: View full request
ja: リクエスト全体を表示
ko: 전체 요청 보기

source: 查看完整调用结果
en: View full call result
ja: 呼び出し結果全体を表示
ko: 전체 호출 결과 보기

source: 查看实际配置
en: View actual configuration
ja: 実際の設定を表示
ko: 실제 구성 보기

source: 查看工作区 Git 改动
en: View workspace Git changes
ja: ワークスペースの Git 変更を表示
ko: 워크스페이스 Git 변경 보기

source: 查看当前对话的 Agent 记忆
en: View Agent memory for this conversation
ja: 現在の会話のエージェントメモリを表示
ko: 현재 대화의 에이전트 메모리 보기

source: 查看当前对话的子代理运行
en: View subagent runs for this conversation
ja: 現在の会話のサブエージェント実行を表示
ko: 현재 대화의 서브 에이전트 실행 보기

source: 标签已满
en: Tab limit reached
ja: タブが上限に達しました
ko: 탭이 가득 찼습니다

source: 标签颜色
en: Label color
ja: ラベルの色
ko: 라벨 색상

source: 标记为%@
en: Mark as %@
ja: %@としてマーク
ko: %@(으)로 표시

source: 标记可供审查
en: Mark ready for review
ja: レビュー可能としてマーク
ko: 리뷰 가능으로 표시

source: 标题
en: Title
ja: タイトル
ko: 제목

source: 核对 Git 操作：%@
en: Review Git operation: %@
ja: Git 操作を確認：%@
ko: Git 작업 확인: %@

source: 根目录
en: Root directory
ja: ルートディレクトリ
ko: 루트 디렉터리

source: 档案将被移除；当前生效的 live 配置保持不变。
en: The profile will be removed; the active live configuration stays unchanged.
ja: プロファイルは削除されます。現在有効な live 設定は変更されません。
ko: 프로필이 삭제됩니다. 현재 적용 중인 live 구성은 그대로 유지됩니다.

source: 检查脚本执行失败：%@
en: Check script failed: %@
ja: チェックスクリプトの実行に失敗しました：%@
ko: 검사 스크립트 실행 실패: %@

source: 检查：通过 %lld · 失败 %lld · 进行中 %lld
en: Checks: %lld passed · %lld failed · %lld in progress
ja: チェック：成功 %lld · 失敗 %lld · 実行中 %lld
ko: 검사: 통과 %lld · 실패 %lld · 진행 중 %lld

source: 检测中
en: Detecting
ja: 検出中
ko: 감지 중

source: 概览
en: Overview
ja: 概要
ko: 개요

source: 模型
en: Model
ja: モデル
ko: 모델

source: 模型 ID
en: Model ID
ja: モデル ID
ko: 모델 ID

source: 模型列表尚未加载，可稍后重试或直接输入模型 ID。
en: The model list hasn't loaded yet. Try again later, or enter a model ID directly.
ja: モデル一覧はまだ読み込まれていません。後で再試行するか、モデル ID を直接入力してください。
ko: 모델 목록이 아직 로드되지 않았습니다. 나중에 다시 시도하거나 모델 ID를 직접 입력하세요.

source: 模型数
en: Models
ja: モデル数
ko: 모델 수

source: 模型（%lld）
en: Models (%lld)
ja: モデル（%lld）
ko: 모델(%lld)

source: 模型：%@
en: Model: %@
ja: モデル：%@
ko: 모델: %@

source: 橙色
en: Orange
ja: オレンジ
ko: 주황색

source: 正在保存…
en: Saving…
ja: 保存中…
ko: 저장 중…

source: 正在停止 PTY…
en: Stopping PTY…
ja: PTY を停止中…
ko: PTY 중지 중…

source: 正在准备相机…
en: Preparing camera…
ja: カメラを準備中…
ko: 카메라 준비 중…

source: 正在加载 %@…
en: Loading %@…
ja: %@ を読み込み中…
ko: %@ 로드 중…

source: 正在加载更早的记录…
en: Loading earlier history…
ja: 以前の履歴を読み込み中…
ko: 이전 기록 로드 중…

source: 正在加载过程记录…
en: Loading activity log…
ja: 処理記録を読み込み中…
ko: 진행 기록 로드 중…

source: 正在压缩上下文…
en: Compacting context…
ja: コンテキストを圧縮中…
ko: 컨텍스트 압축 중…

source: 正在发现工具…
en: Discovering tools…
ja: ツールを検出中…
ko: 도구 검색 중…

source: 正在发送 Agent 请求…
en: Sending Agent request…
ja: エージェントリクエストを送信中…
ko: 에이전트 요청 전송 중…

source: 正在同步…
en: Syncing…
ja: 同期中…
ko: 동기화 중…

source: 正在同步对话记录…
en: Syncing conversation history…
ja: 会話履歴を同期中…
ko: 대화 기록 동기화 중…

source: 正在向后端申请设备验证…
en: Requesting device verification from the backend…
ja: バックエンドにデバイス認証を申請中…
ko: 백엔드에 기기 인증 신청 중…

source: 正在处理
en: Processing
ja: 処理中
ko: 처리 중

source: 正在处理…
en: Processing…
ja: 処理中…
ko: 처리 중…

source: 正在工作
en: Working
ja: 作業中
ko: 작업 중

source: 正在工作 ·
en: Working ·
ja: 作業中 ·
ko: 작업 중 ·

source: 正在打开工作树 %@…
en: Opening worktree %@…
ja: ワークツリー %@ を開いています…
ko: 워크트리 %@ 여는 중…

source: 正在执行 %@…
en: Running %@…
ja: %@ を実行中…
ko: %@ 실행 중…

source: 正在提交…
en: Submitting…
ja: 送信中…
ko: 제출 중…

source: 正在提交升级…
en: Submitting upgrade…
ja: アップグレードを送信中…
ko: 업그레이드 제출 중…

source: 正在提交，请稍候…
en: Submitting, please wait…
ja: 送信中です。しばらくお待ちください…
ko: 제출 중입니다. 잠시 기다려 주세요…

source: 正在搜索工作区文件…
en: Searching workspace files…
ja: ワークスペースのファイルを検索中…
ko: 워크스페이스 파일 검색 중…

source: 正在生成…
en: Generating…
ja: 生成中…
ko: 생성 중…

source: 正在获取模型列表…
en: Fetching model list…
ja: モデル一覧を取得中…
ko: 모델 목록 가져오는 중…

source: 正在补齐记录
en: Backfilling history
ja: 履歴を補完中
ko: 기록 보충 중

source: 正在识别二维码图片…
en: Recognizing QR code image…
ja: QR コード画像を認識中…
ko: QR 코드 이미지 인식 중…

source: 正在读取 %@…
en: Reading %@…
ja: %@ を読み込み中…
ko: %@ 읽는 중…

source: 正在读取 CLI 版本…
en: Reading CLI version…
ja: CLI バージョンを読み込み中…
ko: CLI 버전 읽는 중…

source: 正在读取 Git 状态…
en: Reading Git status…
ja: Git 状態を読み込み中…
ko: Git 상태 읽는 중…

source: 正在读取 PR 状态…
en: Reading PR status…
ja: PR 状態を読み込み中…
ko: PR 상태 읽는 중…

source: 正在读取 Skill 与 MCP 目录…
en: Reading Skill and MCP catalog…
ja: Skill と MCP のカタログを読み込み中…
ko: Skill 및 MCP 카탈로그 읽는 중…

source: 正在读取…
en: Reading…
ja: 読み込み中…
ko: 읽는 중…

source: 正在读取供应商…
en: Reading providers…
ja: プロバイダーを読み込み中…
ko: 프로바이더 읽는 중…

source: 正在读取差异…
en: Reading diff…
ja: 差分を読み込み中…
ko: Diff 읽는 중…

source: 正在调用
en: Calling
ja: 呼び出し中
ko: 호출 중

source: 正在调用…
en: Calling…
ja: 呼び出し中…
ko: 호출 중…

source: 正在进行
en: In progress
ja: 進行中
ko: 진행 중

source: 正在连接…
en: Connecting…
ja: 接続中…
ko: 연결 중…

source: 此 PTY 未在运行 · %lld 个已有 PTY 可通过「终端选项」连接
en: This PTY isn't running · %lld existing PTYs can be attached via “Terminal options”
ja: この PTY は実行されていません · 既存の PTY %lld 個に「ターミナルオプション」から接続できます
ko: 이 PTY는 실행 중이 아닙니다 · 기존 PTY %lld개는 "터미널 옵션"에서 연결할 수 있습니다

source: 此 Skill 已附加到待发送消息
en: This Skill is attached to the pending message
ja: この Skill は送信待ちのメッセージに添付されています
ko: 이 Skill이 전송 대기 중인 메시지에 첨부되었습니다

source: 此 Skill 无效或缺少资源标识
en: This Skill is invalid or missing a resource identifier
ja: この Skill は無効か、リソース識別子がありません
ko: 이 Skill은 유효하지 않거나 리소스 식별자가 없습니다

source: 此前输出无法重放；只会接收连接后的输出。
en: Earlier output can't be replayed; only output after connecting will be received.
ja: 以前の出力は再生できません。接続後の出力のみ受信します。
ko: 이전 출력은 다시 재생할 수 없습니다. 연결 이후의 출력만 수신합니다.

source: 此后端不支持%@，请更新后端后重试。
en: This backend doesn't support %@. Update the backend and try again.
ja: このバックエンドは%@に対応していません。バックエンドを更新してから再試行してください。
ko: 이 백엔드는 %@을(를) 지원하지 않습니다. 백엔드를 업데이트한 후 다시 시도하세요.

source: 此后端未提供参数 Schema，请按工具说明填写 JSON 对象。
en: This backend didn't provide a parameter Schema. Fill in a JSON object according to the tool's description.
ja: このバックエンドはパラメーター Schema を提供していません。ツールの説明に従って JSON オブジェクトを入力してください。
ko: 이 백엔드는 매개변수 Schema를 제공하지 않습니다. 도구 설명에 따라 JSON 객체를 입력하세요.

source: 此审批已处理、已撤回或内容已更新。请从当前记录打开新的请求。
en: This approval has already been handled, withdrawn, or updated. Open the new request from the current history.
ja: この承認は処理済み、取り下げ済み、または内容が更新されています。現在の履歴から新しいリクエストを開いてください。
ko: 이 승인은 이미 처리되었거나 철회되었거나 내용이 업데이트되었습니다. 현재 기록에서 새 요청을 여세요.

source: 此工作区已不在该后端的列表中。
en: This workspace is no longer in this backend's list.
ja: このワークスペースはこのバックエンドの一覧にありません。
ko: 이 워크스페이스는 더 이상 이 백엔드의 목록에 없습니다.

source: 此工作区没有可以重新连接的 PTY。
en: This workspace has no PTY to reconnect to.
ja: このワークスペースには再接続できる PTY がありません。
ko: 이 워크스페이스에는 다시 연결할 수 있는 PTY가 없습니다.

source: 此格式没有可用的文本或原生图片预览。后端未提供可编辑文本。
en: No text or native image preview is available for this format. The backend didn't provide editable text.
ja: この形式にはテキストまたはネイティブ画像のプレビューがありません。バックエンドは編集可能なテキストを提供していません。
ko: 이 형식에는 사용할 수 있는 텍스트 또는 기본 이미지 미리보기가 없습니다. 백엔드가 편집 가능한 텍스트를 제공하지 않았습니다.

source: 此相机不支持二维码识别
en: This camera doesn't support QR code recognition
ja: このカメラは QR コード認識に対応していません
ko: 이 카메라는 QR 코드 인식을 지원하지 않습니다

source: 此设备没有可用相机，请使用二维码图片导入
en: No camera is available on this device. Import a QR code image instead
ja: この端末には利用可能なカメラがありません。QR コード画像から読み込んでください
ko: 이 기기에는 사용할 수 있는 카메라가 없습니다. QR 코드 이미지로 가져오세요

source: 此请求不支持回答。
en: This request doesn't support answers.
ja: このリクエストは回答に対応していません。
ko: 이 요청은 답변을 지원하지 않습니다.

source: 此请求不支持表单回答。
en: This request doesn't support form answers.
ja: このリクエストはフォームでの回答に対応していません。
ko: 이 요청은 폼 답변을 지원하지 않습니다.

source: 每个对话独立
en: Per conversation
ja: 会話ごとに独立
ko: 대화별로 독립

source: 每个对话独立保存工作台
en: Save a separate workbench for each conversation
ja: 会話ごとにワークベンチを個別に保存
ko: 대화마다 워크벤치를 따로 저장

source: 每日用量
en: Daily usage
ja: 日別使用量
ko: 일별 사용량

source: 每次只读取当前目录；搜索可查找其子目录文件。
en: Only the current directory is read each time; search can find files in its subdirectories.
ja: 毎回現在のディレクトリのみを読み込みます。検索ではサブディレクトリ内のファイルも探せます。
ko: 매번 현재 디렉터리만 읽습니다. 검색으로 하위 디렉터리의 파일을 찾을 수 있습니다.

source: 比较并合并
en: Compare and merge
ja: 比較してマージ
ko: 비교 후 병합

source: 永久删除
en: Delete permanently
ja: 完全に削除
ko: 영구 삭제

source: 永久删除对话？
en: Permanently delete conversation?
ja: 会話を完全に削除しますか？
ko: 대화를 영구 삭제하시겠습니까?

source: 汇总各 Agent 共享的 Skill 与 MCP
en: Skills and MCP shared across agents
ja: 各エージェントで共有される Skill と MCP をまとめて表示
ko: 에이전트 간에 공유되는 Skill 및 MCP 모음

source: 没有关联 PR
en: No linked PR
ja: 関連する PR はありません
ko: 연결된 PR 없음

source: 没有匹配的 Skill 或 MCP
en: No matching Skill or MCP
ja: 一致する Skill または MCP はありません
ko: 일치하는 Skill 또는 MCP 없음

source: 没有匹配的文件
en: No matching files
ja: 一致するファイルはありません
ko: 일치하는 파일 없음

source: 没有可关联的对话
en: No conversations to link
ja: 関連付けできる会話はありません
ko: 연결할 수 있는 대화 없음

source: 没有可显示的差异（文件未更改或为二进制）。
en: No diff to show (file unchanged or binary).
ja: 表示できる差分はありません（ファイルが未変更またはバイナリです）。
ko: 표시할 Diff가 없습니다(파일이 변경되지 않았거나 바이너리입니다).

source: 没有已同步的运行任务
en: No synced running tasks
ja: 同期済みの実行中タスクはありません
ko: 동기화된 실행 작업 없음

source: 没有归档对话
en: No archived conversations
ja: アーカイブされた会話はありません
ko: 보관된 대화 없음

source: 没有找到可用项目
en: No available projects found
ja: 利用可能なプロジェクトが見つかりません
ko: 사용 가능한 프로젝트를 찾지 못했습니다

source: 没有运行中的终端
en: No running terminals
ja: 実行中のターミナルはありません
ko: 실행 중인 터미널 없음

source: 浅色
en: Light
ja: ライト
ko: 라이트

source: 测试后端
en: Test backend
ja: バックエンドをテスト
ko: 백엔드 테스트

source: 消息
en: Message
ja: メッセージ
ko: 메시지

source: 消息提交结果待核对
en: Message submission result needs review
ja: メッセージ送信結果の確認が必要です
ko: 메시지 제출 결과 확인 필요

source: 消息等待核对 · 查看
en: Message needs review · View
ja: メッセージの確認待ち · 表示
ko: 메시지 확인 대기 · 보기

source: 消息输入框
en: Message input
ja: メッセージ入力欄
ko: 메시지 입력란

source: 深色
en: Dark
ja: ダーク
ko: 다크

source: 添加
en: Add
ja: 追加
ko: 추가

source: 添加为引用
en: Add as reference
ja: 参照として追加
ko: 참조로 추가

source: 添加供应商
en: Add provider
ja: プロバイダーを追加
ko: 프로바이더 추가

source: 添加其他目录
en: Add another directory
ja: 他のディレクトリを追加
ko: 다른 디렉터리 추가

source: 添加到对话
en: Add to conversation
ja: 会話に追加
ko: 대화에 추가

source: 添加后端
en: Add backend
ja: バックエンドを追加
ko: 백엔드 추가

source: 添加后端上的项目目录，创建你的第一个对话。
en: Add a project directory on the backend to create your first conversation.
ja: バックエンド上のプロジェクトディレクトリを追加して、最初の会話を作成しましょう。
ko: 백엔드의 프로젝트 디렉터리를 추가해 첫 대화를 만드세요.

source: 添加工作区
en: Add workspace
ja: ワークスペースを追加
ko: 워크스페이스 추가

source: 添加工作区后，可在这里按工作区管理任务并贴到对话。
en: After adding a workspace, you can manage tasks by workspace here and paste them into conversations.
ja: ワークスペースを追加すると、ここでワークスペースごとにタスクを管理し、会話に貼り付けられます。
ko: 워크스페이스를 추가하면 여기에서 워크스페이스별로 작업을 관리하고 대화에 붙여 넣을 수 있습니다.

source: 添加并信任工作区
en: Add and trust workspace
ja: ワークスペースを追加して信頼
ko: 워크스페이스 추가 및 신뢰

source: 添加模型
en: Add model
ja: モデルを追加
ko: 모델 추가

source: 添加模型（逗号或空格分隔）
en: Add models (separated by commas or spaces)
ja: モデルを追加（カンマまたはスペース区切り）
ko: 모델 추가(쉼표 또는 공백으로 구분)

source: 添加消息
en: Add message
ja: メッセージを追加
ko: 메시지 추가

source: 清屏
en: Clear screen
ja: 画面をクリア
ko: 화면 지우기

source: 清空
en: Clear all
ja: すべてクリア
ko: 모두 지우기

source: 清除
en: Clear
ja: クリア
ko: 지우기

source: 源码
en: Source
ja: ソース
ko: 소스

source: 点按切换到此后端
en: Tap to switch to this backend
ja: タップしてこのバックエンドに切り替え
ko: 탭하여 이 백엔드로 전환

source: 点按切换；未在列表中的模型可返回后通过“添加模型”输入。
en: Tap to switch. For models not in the list, go back and enter them via “Add model”.
ja: タップして切り替えます。一覧にないモデルは、戻って「モデルを追加」から入力してください。
ko: 탭하여 전환합니다. 목록에 없는 모델은 돌아가서 "모델 추가"로 입력하세요.

source: 点按刷新
en: Tap to refresh
ja: タップして更新
ko: 탭하여 새로고침

source: 点按清空本批次后重新导入
en: Tap to clear this batch and import again
ja: タップしてこのバッチをクリアし、再度読み込む
ko: 탭하여 이번 배치를 지우고 다시 가져오기

source: 点按重试
en: Tap to retry
ja: タップして再試行
ko: 탭하여 다시 시도

source: 点按页面中的元素以选择
en: Tap an element on the page to select it
ja: ページ内の要素をタップして選択
ko: 페이지의 요소를 탭하여 선택

source: 照片
en: Photos
ja: 写真
ko: 사진

source: 父元素
en: Parent element
ja: 親要素
ko: 상위 요소

source: 版本不一致
en: Version mismatch
ja: バージョン不一致
ko: 버전 불일치

source: 版本检查
en: Version check
ja: バージョン確認
ko: 버전 확인

source: 状态
en: Status
ja: 状態
ko: 상태

source: 状态刷新不能证明提交、推送或 PR 是否成功。确认已检查实际结果后才可继续。
en: Refreshing status doesn't prove whether the commit, push, or PR succeeded. Continue only after confirming you've checked the actual result.
ja: 状態の更新だけではコミット、プッシュ、PR が成功したかは確認できません。実際の結果を確認してから続行してください。
ko: 상태를 새로 고쳐도 커밋, 푸시 또는 PR의 성공 여부는 확인되지 않습니다. 실제 결과를 확인한 후에만 계속할 수 있습니다.

source: 状态待核对 · 输入已暂停
en: Status needs review · Input paused
ja: 状態の確認待ち · 入力を一時停止中
ko: 상태 확인 대기 · 입력 일시 중지됨

source: 状态未知
en: Status unknown
ja: 状態不明
ko: 상태 알 수 없음

source: 状态查询失败：%@
en: Status query failed: %@
ja: 状態の取得に失敗しました：%@
ko: 상태 조회 실패: %@

source: 状态：%@
en: Status: %@
ja: 状態：%@
ko: 상태: %@

source: 状态：%@ 请求权限 %@ 实际配置 %@ %@
en: Status: %@ Requested permissions %@ Actual configuration %@ %@
ja: 状態：%@ 要求された権限 %@ 実際の設定 %@ %@
ko: 상태: %@ 요청 권한 %@ 실제 구성 %@ %@

source: 状态：%@%@ · %@ → %@
en: Status: %@%@ · %@ → %@
ja: 状態：%@%@ · %@ → %@
ko: 상태: %@%@ · %@ → %@

source: 独占型（Codex、Claude Code、Grok Build）激活时改写全局配置文件，对 TodeX 内外的新会话同时生效；叠加型（Pi、OpenCode）保存即写入全局配置、可多个并存，「默认」为该 Agent 的启动默认选中，在 Agent 侧修改。
en: Exclusive agents (Codex, Claude Code, Grok Build) rewrite the global config file when a provider is activated, applying to new sessions in and outside TodeX. Additive agents (Pi, OpenCode) write to the global config on save and can keep several providers at once; “Default” marks the agent's startup selection and is changed on the agent side.
ja: 排他型（Codex・Claude Code・Grok Build）は有効化時にグローバル設定ファイルを書き換え、TodeX 内外の新しいセッションに適用されます。併用型（Pi・OpenCode）は保存するとグローバル設定に書き込まれ、複数を同時に使えます。「デフォルト」はエージェントの起動時の選択で、エージェント側で変更します。
ko: 독점형(Codex, Claude Code, Grok Build)은 활성화하면 전역 설정 파일을 다시 작성하며 TodeX 안팎의 새 세션에 적용됩니다. 병행형(Pi, OpenCode)은 저장하면 전역 설정에 기록되고 여러 개를 동시에 둘 수 있습니다. "기본"은 해당 에이전트의 시작 시 기본 선택이며 에이전트 측에서 변경합니다.

source: 用户记忆
en: User memory
ja: ユーザーメモリ
ko: 사용자 메모리

source: 用时
en: Duration
ja: 所要時間
ko: 소요 시간

source: 用量
en: Usage
ja: 使用量
ko: 사용량

source: 用量记录
en: Usage records
ja: 使用量の記録
ko: 사용량 기록

source: 申请已过期，请重新申请。
en: The request expired; request again.
ja: 申請が期限切れになりました。再度申請してください。
ko: 신청이 만료되었습니다. 다시 신청하세요.

source: 申请设备验证
en: Request device verification
ja: デバイス認証を申請
ko: 기기 인증 신청

source: 留空使用 xAI 官方 API（%@）
en: Leave empty to use the official xAI API (%@)
ja: 空欄の場合は xAI 公式 API（%@）を使用
ko: 비워 두면 xAI 공식 API(%@) 사용

source: 目录
en: Directory
ja: ディレクトリ
ko: 디렉터리

source: 目录响应缺少 entries
en: Directory response is missing entries
ja: ディレクトリの応答に entries がありません
ko: 디렉터리 응답에 entries가 없습니다

source: 目录在后端不可用
en: Directory is unavailable on the backend
ja: ディレクトリはバックエンドで利用できません
ko: 백엔드에서 디렉터리를 사용할 수 없습니다

source: 目录在后端不可用：%@
en: Directory is unavailable on the backend: %@
ja: ディレクトリはバックエンドで利用できません：%@
ko: 백엔드에서 디렉터리를 사용할 수 없습니다: %@

source: 目录已被使用
en: Directory already in use
ja: ディレクトリは使用中です
ko: 디렉터리가 이미 사용 중

source: 目录无效
en: Invalid directory
ja: 無効なディレクトリです
ko: 유효하지 않은 디렉터리

source: 目录未更改
en: Directory unchanged
ja: ディレクトリは変更されていません
ko: 디렉터리가 변경되지 않았습니다

source: 目录浏览
en: Directory browser
ja: ディレクトリブラウザ
ko: 디렉터리 탐색

source: 目标仓库
en: Target repository
ja: 対象リポジトリ
ko: 대상 리포지토리

source: 目标仓库（%lld）
en: Target repositories (%lld)
ja: 対象リポジトリ（%lld）
ko: 대상 리포지토리(%lld)

source: 目标仓库（owner/repo）
en: Target repository (owner/repo)
ja: 対象リポジトリ（owner/repo）
ko: 대상 리포지토리(owner/repo)

source: 目标仓库：
en: Target repository:
ja: 対象リポジトリ：
ko: 대상 리포지토리:

source: 直接执行
en: Run directly
ja: 直接実行
ko: 바로 실행

source: 相机中断已结束，请继续扫码；若画面未恢复，可点按重试相机。
en: The camera interruption has ended; continue scanning. If the preview doesn't return, tap to retry the camera.
ja: カメラの中断が終了しました。スキャンを続けてください。画面が戻らない場合はタップしてカメラを再試行できます。
ko: 카메라 중단이 끝났습니다. 계속 스캔하세요. 화면이 돌아오지 않으면 탭하여 카메라를 다시 시도할 수 있습니다.

source: 相机发生错误，请重试或使用照片导入。
en: A camera error occurred. Try again or import from Photos.
ja: カメラでエラーが発生しました。再試行するか、写真から読み込んでください。
ko: 카메라 오류가 발생했습니다. 다시 시도하거나 사진으로 가져오세요.

source: 相机已中断。请返回前台后重试，或使用照片导入。
en: The camera was interrupted. Return to the app and try again, or import from Photos.
ja: カメラが中断されました。アプリに戻ってから再試行するか、写真から読み込んでください。
ko: 카메라가 중단되었습니다. 앱으로 돌아와 다시 시도하거나 사진으로 가져오세요.

source: 相机扫码
en: Scan with camera
ja: カメラでスキャン
ko: 카메라로 스캔

source: 相机无法启动，请重试或使用照片导入
en: Camera couldn't start. Try again or import from Photos.
ja: カメラを起動できません。再試行するか、写真から読み込んでください。
ko: 카메라를 시작할 수 없습니다. 다시 시도하거나 사진에서 가져오세요.

source: 相机权限设置
en: Camera permission settings
ja: カメラの権限設定
ko: 카메라 권한 설정

source: 相机输入不可用
en: Camera input unavailable
ja: カメラ入力を利用できません
ko: 카메라 입력을 사용할 수 없음

source: 知道了
en: Got it
ja: 了解
ko: 알겠습니다

source: 确定
en: OK
ja: OK
ko: 확인

source: 确认
en: Confirm
ja: 確認
ko: 확인

source: 确认后提交此操作
en: Submit this action after confirming
ja: 確認後にこの操作を送信します
ko: 확인 후 이 작업을 제출합니다

source: 确认执行
en: Confirm and run
ja: 実行を確認
ko: 실행 확인

source: 确认操作
en: Confirm action
ja: 操作を確認
ko: 작업 확인

source: 禁用页面脚本
en: Disable page scripts
ja: ページスクリプトを無効化
ko: 페이지 스크립트 비활성화

source: 离开标签不会自动结束后端 PTY。
en: Leaving the tab won't end the backend PTY.
ja: タブを離れてもバックエンドの PTY は自動終了しません。
ko: 탭을 떠나도 백엔드 PTY는 자동으로 종료되지 않습니다.

source: 移除工作区
en: Remove workspace
ja: ワークスペースを削除
ko: 워크스페이스 삭제

source: 移除工作区？
en: Remove workspace?
ja: ワークスペースを削除しますか？
ko: 워크스페이스를 삭제하시겠습니까?

source: 移除工作树（保留分支）
en: Remove worktree (keep branch)
ja: ワークツリーを削除（ブランチは保持）
ko: 워크트리 삭제(브랜치 유지)

source: 移除本机保存的“%@”连接配置。
en: Remove the “%@” connection settings saved on this device.
ja: この端末に保存された「%@」の接続設定を削除します。
ko: 이 기기에 저장된 “%@” 연결 설정을 삭제합니다.

source: 移除标签
en: Clear label
ja: ラベルを削除
ko: 라벨 지우기

source: 移除模型
en: Remove model
ja: モデルを削除
ko: 모델 삭제

source: 移除此工作树
en: Remove this worktree
ja: このワークツリーを削除
ko: 이 워크트리 삭제

source: 移除：%@
en: Remove: %@
ja: 削除：%@
ko: 삭제: %@

source: 等待后端批准…
en: Waiting for backend approval…
ja: バックエンドの承認を待っています…
ko: 백엔드 승인 대기 중…

source: 等待后端批准，请核对随机码。
en: Waiting for backend approval. Verify the random code.
ja: バックエンドの承認を待っています。ランダムコードを確認してください。
ko: 백엔드 승인을 기다리는 중입니다. 랜덤 코드를 확인하세요.

source: 等待回应
en: Awaiting response
ja: 応答待ち
ko: 응답 대기 중

source: 等待审批
en: Awaiting approval
ja: 承認待ち
ko: 승인 대기 중

source: 等待对应 codex.control.response 超时
en: Timed out waiting for the matching codex.control.response
ja: 対応する codex.control.response の待機がタイムアウトしました
ko: 해당 codex.control.response 대기 시간이 초과되었습니다

source: 等待执行
en: Queued
ja: 待機中
ko: 대기 중

source: 筛选
en: Filter
ja: フィルター
ko: 필터

source: 管理 Codex、Claude Code、Grok Build、Pi、OpenCode 的供应商与模型
en: Manage providers and models for Codex, Claude Code, Grok Build, Pi, and OpenCode
ja: Codex、Claude Code、Grok Build、Pi、OpenCode のプロバイダーとモデルを管理
ko: Codex, Claude Code, Grok Build, Pi, OpenCode의 프로바이더와 모델 관리

source: 管理 PR
en: Manage PR
ja: PR を管理
ko: PR 관리

source: 类型
en: Kind
ja: 種類
ko: 유형

source: 粉色
en: Pink
ja: ピンク
ko: 분홍

source: 粘贴后端 TUI 提供的完整 JSON，或本批次的一个二维码分片。
en: Paste the full JSON from the backend TUI, or one QR code chunk from this batch.
ja: バックエンド TUI が提供する完全な JSON、またはこのバッチの QR コードフラグメントを 1 つ貼り付けてください。
ko: 백엔드 TUI가 제공한 전체 JSON 또는 이번 배치의 QR 코드 조각 하나를 붙여넣으세요.

source: 粘贴的图片.jpg
en: Pasted image.jpg
ja: 貼り付けた画像.jpg
ko: 붙여넣은 이미지.jpg

source: 粘贴的文本
en: Pasted text
ja: 貼り付けたテキスト
ko: 붙여넣은 텍스트

source: 粘贴配对 JSON
en: Paste pairing JSON
ja: ペアリング JSON を貼り付け
ko: 페어링 JSON 붙여넣기

source: 系统拒绝了 TodeX 的通知权限。请在系统设置中允许通知后再开启。
en: The system denied notification permission for TodeX. Allow notifications in Settings, then turn this on again.
ja: システムが TodeX の通知権限を拒否しました。設定で通知を許可してから、もう一度オンにしてください。
ko: 시스템이 TodeX의 알림 권한을 거부했습니다. 설정에서 알림을 허용한 후 다시 켜세요.

source: 紫色
en: Purple
ja: パープル
ko: 보라

source: 红色
en: Red
ja: レッド
ko: 빨강

source: 终端
en: Terminal
ja: ターミナル
ko: 터미널

source: 终端状态响应缺少列表，无法确认 PTY 状态。
en: The terminal status response has no list, so the PTY status can't be confirmed.
ja: ターミナル状態の応答に一覧がないため、PTY の状態を確認できません。
ko: 터미널 상태 응답에 목록이 없어 PTY 상태를 확인할 수 없습니다.

source: 终端选项
en: Terminal options
ja: ターミナルオプション
ko: 터미널 옵션

source: 终端错误，请查询状态
en: Terminal error. Check the status.
ja: ターミナルエラー。状態を確認してください
ko: 터미널 오류. 상태를 확인하세요

source: 结束
en: Finished
ja: 終了
ko: 종료

source: 结果
en: Result
ja: 結果
ko: 결과

source: 结果未知；写操作已暂停。
en: Outcome unknown; write operations are paused.
ja: 結果が不明です。書き込み操作を一時停止しました。
ko: 결과를 알 수 없습니다. 쓰기 작업을 일시 중지했습니다.

source: 绝对路径
en: Absolute path
ja: 絶対パス
ko: 절대 경로
